In [1]:
## Dataset: https://github.com/krishnaik06/5-Days-Live-EDA-and-Feature-Engineering/tree/main/Flight%20Prediction

In [4]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt 
import seaborn as sns 
%matplotlib inline 
#to show diagram without plot.show()

In [6]:
train_df=pd.read_excel("Data_Train.xlsx")
train_df.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302

In [12]:
train_df.shape

(10683, 11)

In [9]:
test_df=pd.read_excel("Test_Set.xlsx")
test_df.head()

#here there is no last column price (dependant variable)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info
0,Jet Airways,6/06/2019,Delhi,Cochin,DEL → BOM → COK,17:30,04:25 07 Jun,10h 55m,1 stop,No info
1,IndiGo,12/05/2019,Kolkata,Banglore,CCU → MAA → BLR,06:20,10:20,4h,1 stop,No info
2,Jet Airways,21/05/2019,Delhi,Cochin,DEL → BOM → COK,19:15,19:00 22 May,23h 45m,1 stop,In-flight meal not included
3,Multiple carriers,21/05/2019,Delhi,Cochin,DEL → BOM → COK,08:00,21:00,13h,1 stop,No info
4,Air Asia,24/06/2019,Banglore,Delhi,BLR → DEL,23:55,02:45 25 Jun,2h 50m,non-stop,No info

In [13]:
test_df.shape

(2671, 10)

In [10]:
#combing both train and test

final_df= train_df.append(test_df)
final_df.head()

/var/folders/pz/8fj7_jqs1_lglvwks1ym9jl40000gn/T/ipykernel_2082/2485537029.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  final_df= train_df.append(test_df)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897.0
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662.0
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882.0
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218.0
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302.0

In [11]:
final_df.tail()

#if we check tail of combined dataset, we can see there are NaN values, this is the test_df

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
2666,Air India,6/06/2019,Kolkata,Banglore,CCU → DEL → BLR,20:30,20:25 07 Jun,23h 55m,1 stop,No info,NaN
2667,IndiGo,27/03/2019,Kolkata,Banglore,CCU → BLR,14:20,16:55,2h 35m,non-stop,No info,NaN
2668,Jet Airways,6/03/2019,Delhi,Cochin,DEL → BOM → COK,21:50,04:25 07 Mar,6h 35m,1 stop,No info,NaN
2669,Air India,6/03/2019,Delhi,Cochin,DEL → BOM → COK,04:00,19:15,15h 15m,1 stop,No info,NaN
2670,Multiple carriers,15/06/2019,Delhi,Cochin,DEL → BOM → COK,04:55,19:15,14h 20m,1 stop,No info,NaN

In [14]:
final_df.shape

(13354, 11)

In [15]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13354 entries, 0 to 2670
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          13354 non-null  object
 1   Date_of_Journey  13354 non-null  object
 2   Source           13354 non-null  object
 3   Destination      13354 non-null  object
 4   Route            13353 non-null  object
 5   Dep_Time         13354 non-null  object
 6   Arrival_Time     13354 non-null  object
 7   Duration         13354 non-null  object
 8   Total_Stops      13353 non-null  object
 9   Additional_Info  13354 non-null  object
 10  Price            10683 non-null  float64
dtypes: float64(1), object(10)
memory usage: 1.2+ MB

## Checking for null values

In [38]:
final_df.isnull().sum()

# Route and total stop has just 1 null values
# Price has 2671 null values, this is totally valid as its part of test data

Airline               0
Source                0
Destination           0
Route                 1
Dep_Time              0
Arrival_Time          0
Duration              0
Total_Stops           1
Additional_Info       0
Price              2671
Date                  0
Month                 0
Year                  0
dtype: int64

## Feature Engineering

### Numerical Feature
1. Date_of_Journey
2. Arrival_Time
3. Dep_Time
4. Route and Total_Stops
5. Duration

### Categorical Feature

1. Airline
2. Source
3. Destination 


### Output/ Dependant Feature 

1. Price

## Numerical Features

### 1. Date_of_Journey

1. Date_of_Journey has dd/mm/yyyy. Pick up day, month, year: create 3 more feilds. Derived features
2. Once we get 3 more columns, convert all these into integer
3. Delete Date_of_Journey

In [18]:
final_df['Date']=  final_df['Date_of_Journey'].str.split('/')
final_df['Date']

# this is coverting date of journey into string and splitting by /

0       [24, 03, 2019]
1        [1, 05, 2019]
2        [9, 06, 2019]
3       [12, 05, 2019]
4       [01, 03, 2019]
             ...
2666     [6, 06, 2019]
2667    [27, 03, 2019]
2668     [6, 03, 2019]
2669     [6, 03, 2019]
2670    [15, 06, 2019]
Name: Date, Length: 13354, dtype: object

In [19]:
# to fetch the 1st element, use index 
final_df['Date']=  final_df['Date_of_Journey'].str.split('/').str[0]
final_df['Date']

0       24
1        1
2        9
3       12
4       01
        ..
2666     6
2667    27
2668     6
2669     6
2670    15
Name: Date, Length: 13354, dtype: object

In [20]:
#split from  Date_of_Journey  by forward slash 

final_df['Date']=  final_df['Date_of_Journey'].str.split('/').str[0]#first convert into string and then split 
final_df['Month']= final_df['Date_of_Journey'].str.split('/').str[1]
final_df['Year']= final_df['Date_of_Journey'].str.split('/').str[2]

In [21]:
final_df.head(2)
#in the end, date month and year is created

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897.0,24,03,2019
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662.0,1,05,2019

In [22]:
#using lambda 

#final_df['Date']=  final_df['Date_of_Journey'].apply(lambda x:x.split('/')[0])
#final_df['Date']=  final_df['Date_of_Journey'].apply(lambda x:x.split('/')[1])
#final_df['Date']=  final_df['Date_of_Journey'].apply(lambda x:x.split('/')[2])

In [25]:
# all these 3 new columns are object type. 
# to train data, we need all of these be in int format 
final_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13354 entries, 0 to 2670
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          13354 non-null  object
 1   Date_of_Journey  13354 non-null  object
 2   Source           13354 non-null  object
 3   Destination      13354 non-null  object
 4   Route            13353 non-null  object
 5   Dep_Time         13354 non-null  object
 6   Arrival_Time     13354 non-null  object
 7   Duration         13354 non-null  object
 8   Total_Stops      13353 non-null  object
 9   Additional_Info  13354 non-null  object
 10  Price            10683 non-null  float64
 11  Date             13354 non-null  object
 12  Month            13354 non-null  object
 13  Year             13354 non-null  object
dtypes: float64(1), object(13)
memory usage: 1.5+ MB

In [28]:
#to covert last  3 cols into int 

final_df['Date']=final_df['Date'].astype(int)
final_df['Month']=final_df['Month'].astype(int)
final_df['Year']=final_df['Year'].astype(int)

In [29]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13354 entries, 0 to 2670
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          13354 non-null  object
 1   Date_of_Journey  13354 non-null  object
 2   Source           13354 non-null  object
 3   Destination      13354 non-null  object
 4   Route            13353 non-null  object
 5   Dep_Time         13354 non-null  object
 6   Arrival_Time     13354 non-null  object
 7   Duration         13354 non-null  object
 8   Total_Stops      13353 non-null  object
 9   Additional_Info  13354 non-null  object
 10  Price            10683 non-null  float64
 11  Date             13354 non-null  int64
 12  Month            13354 non-null  int64
 13  Year             13354 non-null  int64
dtypes: float64(1), int64(3), object(10)
memory usage: 1.5+ MB

In [31]:
# dropping Date_of_Journey

final_df.drop('Date_of_Journey', axis=1, inplace=True)

In [32]:
final_df.head(1)

,Airline,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year
0,IndiGo,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897.0,24,3,2019

### 2. Arrival Time

Checking the same type pf features, time/date feature in this case. I have chosen Arrival time

Arrival time has data like: 01:10 22 Mar, 23:30 and so on 

1. We do not require date 22 Mar, because I have already date month in exclusive column.
2. split the Arrival time with space. 
3. fetch the 2st index that has time
4. Once we get the time, extract hour and minutes
5. New column, hour and min are created. These column's dtype is still object, convert into int 
6. Delete Arrival_Time column

In [33]:
#splitting using space
final_df['Arrival_Time'].str.split(' ')

0       [01:10, 22, Mar]
1                [13:15]
2       [04:25, 10, Jun]
3                [23:30]
4                [21:35]
              ...
2666    [20:25, 07, Jun]
2667             [16:55]
2668    [04:25, 07, Mar]
2669             [19:15]
2670             [19:15]
Name: Arrival_Time, Length: 13354, dtype: object

In [34]:
# out of that we need just 1st index. str[0]
final_df['Arrival_Time'].str.split(' ').str[0]

0       01:10
1       13:15
2       04:25
3       23:30
4       21:35
        ...
2666    20:25
2667    16:55
2668    04:25
2669    19:15
2670    19:15
Name: Arrival_Time, Length: 13354, dtype: object

In [36]:
# same thing using lambda 
final_df['Arrival_Time']=final_df['Arrival_Time'].apply(lambda x:x.split(' ')[0])
final_df['Arrival_Time']

0       01:10
1       13:15
2       04:25
3       23:30
4       21:35
        ...
2666    20:25
2667    16:55
2668    04:25
2669    19:15
2670    19:15
Name: Arrival_Time, Length: 13354, dtype: object

In [39]:
# extracting hour and minutes, splitting with colon 

final_df['Arrival_hour']= final_df['Arrival_Time'].str.split(":").str[0]
final_df['Arrival_min']= final_df['Arrival_Time'].str.split(":").str[1]

In [40]:
final_df.head(1)

# 2 more columns arrival hour and min is created at the end of DF

,Airline,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year,Arrival_hour,Arrival_min
0,IndiGo,Banglore,New Delhi,BLR → DEL,22:20,01:10,2h 50m,non-stop,No info,3897.0,24,3,2019,01,10

In [43]:
final_df['Arrival_hour'].dtype
# its data type is still object,we need to change datatype into int

dtype('O')

In [44]:
final_df['Arrival_hour']= final_df['Arrival_hour'].astype(int)
final_df['Arrival_min']= final_df['Arrival_min'].astype(int)

In [46]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13354 entries, 0 to 2670
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          13354 non-null  object
 1   Source           13354 non-null  object
 2   Destination      13354 non-null  object
 3   Route            13353 non-null  object
 4   Dep_Time         13354 non-null  object
 5   Arrival_Time     13354 non-null  object
 6   Duration         13354 non-null  object
 7   Total_Stops      13353 non-null  object
 8   Additional_Info  13354 non-null  object
 9   Price            10683 non-null  float64
 10  Date             13354 non-null  int64
 11  Month            13354 non-null  int64
 12  Year             13354 non-null  int64
 13  Arrival_hour     13354 non-null  int64
 14  Arrival_min      13354 non-null  int64
dtypes: float64(1), int64(5), object(9)
memory usage: 2.1+ MB

In [47]:
final_df.drop('Arrival_Time', axis=1, inplace=True)

In [48]:
final_df.head(1)

,Airline,Source,Destination,Route,Dep_Time,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year,Arrival_hour,Arrival_min
0,IndiGo,Banglore,New Delhi,BLR → DEL,22:20,2h 50m,non-stop,No info,3897.0,24,3,2019,1,10

### 3. Departure time

Repeating the same as Arrival time

Split using : -> hour and min col -> change object type to int type -> delete dept_time

In [50]:
final_df['Dep_Time'].str.split(' ')

0       [22:20]
1       [05:50]
2       [09:25]
3       [18:05]
4       [16:50]
         ...
2666    [20:30]
2667    [14:20]
2668    [21:50]
2669    [04:00]
2670    [04:55]
Name: Dep_Time, Length: 13354, dtype: object

In [51]:
final_df['Dep_Time'].str.split(' ').str[0]

0       22:20
1       05:50
2       09:25
3       18:05
4       16:50
        ...
2666    20:30
2667    14:20
2668    21:50
2669    04:00
2670    04:55
Name: Dep_Time, Length: 13354, dtype: object

In [52]:
final_df['Dep_hour']= final_df['Dep_Time'].str.split(":").str[0]
final_df['Dep_min']= final_df['Dep_Time'].str.split(":").str[1]

In [53]:
final_df.head(1)

,Airline,Source,Destination,Route,Dep_Time,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year,Arrival_hour,Arrival_min,Dep_hour,Dep_min
0,IndiGo,Banglore,New Delhi,BLR → DEL,22:20,2h 50m,non-stop,No info,3897.0,24,3,2019,1,10,22,20

In [54]:
final_df['Dep_hour']= final_df['Dep_hour'].astype(int)
final_df['Dep_min']= final_df['Dep_min'].astype(int)

In [55]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13354 entries, 0 to 2670
Data columns (total 16 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          13354 non-null  object
 1   Source           13354 non-null  object
 2   Destination      13354 non-null  object
 3   Route            13353 non-null  object
 4   Dep_Time         13354 non-null  object
 5   Duration         13354 non-null  object
 6   Total_Stops      13353 non-null  object
 7   Additional_Info  13354 non-null  object
 8   Price            10683 non-null  float64
 9   Date             13354 non-null  int64
 10  Month            13354 non-null  int64
 11  Year             13354 non-null  int64
 12  Arrival_hour     13354 non-null  int64
 13  Arrival_min      13354 non-null  int64
 14  Dep_hour         13354 non-null  int64
 15  Dep_min          13354 non-null  int64
dtypes: float64(1), int64(7), object(8)
memory usage: 2.2+ MB

In [56]:
final_df.drop('Dep_Time', axis=1, inplace=True)
final_df.head(1)

,Airline,Source,Destination,Route,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year,Arrival_hour,Arrival_min,Dep_hour,Dep_min
0,IndiGo,Banglore,New Delhi,BLR → DEL,2h 50m,non-stop,No info,3897.0,24,3,2019,1,10,22,20

### 4. Route and Total_Stops

1. My dataframe has Source, Destination and total number of stops. This altogether gives me the info of Route. 

ex: CCU-> BLR-> IXE

My source column has Kolkatta , destination has Mangalore. Total_stops has 1. That means, I know my flight will have 1 stop ( not sure where it will stop)

If we take this info, we can delete the Route column. 



2. But, here I am predicting the Price. Flight with one/many stops has more price than the non stop ones

3. If I delete the Route, I may not predict the price accurately. 

4. It doesnt matter as I also have total_stops, I can predict with that. 

5. Find null in Total_stops. Fill it with appropriate value. 
6. map Number of stops with that specific number
7. Delete Route

In [57]:
final_df['Total_Stops'].unique()

array(['non-stop', '2 stops', '1 stop', '3 stops', nan, '4 stops'],
      dtype=object)

In [59]:
final_df['Total_Stops'].isnull().sum()

1

In [61]:
final_df[final_df['Total_Stops'].isnull()]
# from here the flight goes from Delhi to Cochin. Duration here is 23 hours.
#if it was direct flight, duration wont be 23 hours. That is it has to be connecting. 
# googled. It can have 2 or 1 stop. Generally, it stops in bangalore. 
#Hence, I will fill NaN as 1

,Airline,Source,Destination,Route,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year,Arrival_hour,Arrival_min,Dep_hour,Dep_min
9039,Air India,Delhi,Cochin,NaN,23h 40m,NaN,No info,7480.0,6,5,2019,9,25,9,45

In [60]:
final_df['Total_Stops'].unique()

#we will map the number of stops

array(['non-stop', '2 stops', '1 stop', '3 stops', nan, '4 stops'],
      dtype=object)

In [62]:
final_df['Total_Stops']=final_df['Total_Stops'].map({'non-stop':0, '1 stop':1, '2 stops':2, '3 stops':3, '4 stops':4, 'nan':1})

In [63]:
final_df.head()

,Airline,Source,Destination,Route,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year,Arrival_hour,Arrival_min,Dep_hour,Dep_min
0,IndiGo,Banglore,New Delhi,BLR → DEL,2h 50m,0.0,No info,3897.0,24,3,2019,1,10,22,20
1,Air India,Kolkata,Banglore,CCU → IXR → BBI → BLR,7h 25m,2.0,No info,7662.0,1,5,2019,13,15,5,50
2,Jet Airways,Delhi,Cochin,DEL → LKO → BOM → COK,19h,2.0,No info,13882.0,9,6,2019,4,25,9,25
3,IndiGo,Kolkata,Banglore,CCU → NAG → BLR,5h 25m,1.0,No info,6218.0,12,5,2019,23,30,18,5
4,IndiGo,Banglore,New Delhi,BLR → NAG → DEL,4h 45m,1.0,No info,13302.0,1,3,2019,21,35,16,50

In [64]:
#now dropping Route column 

final_df.drop('Route', axis=1, inplace=True)
final_df.head(1)

,Airline,Source,Destination,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year,Arrival_hour,Arrival_min,Dep_hour,Dep_min
0,IndiGo,Banglore,New Delhi,2h 50m,0.0,No info,3897.0,24,3,2019,1,10,22,20

In [65]:
final_df.info()

#total_stops is already in float so no need to changing data type

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13354 entries, 0 to 2670
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          13354 non-null  object
 1   Source           13354 non-null  object
 2   Destination      13354 non-null  object
 3   Duration         13354 non-null  object
 4   Total_Stops      13353 non-null  float64
 5   Additional_Info  13354 non-null  object
 6   Price            10683 non-null  float64
 7   Date             13354 non-null  int64
 8   Month            13354 non-null  int64
 9   Year             13354 non-null  int64
 10  Arrival_hour     13354 non-null  int64
 11  Arrival_min      13354 non-null  int64
 12  Dep_hour         13354 non-null  int64
 13  Dep_min          13354 non-null  int64
dtypes: float64(2), int64(7), object(5)
memory usage: 2.0+ MB

In [66]:
final_df['Additional_Info'].unique()

array(['No info', 'In-flight meal not included',
       'No check-in baggage included', '1 Short layover', 'No Info',
       '1 Long layover', 'Change airports', 'Business class',
       'Red-eye flight', '2 Long layover'], dtype=object)

### 5. Duration 

1. Duration has hours and minutes. Convert hours into minutes and display total minutes as duration
2. That is, duration has to be in minutes. 

3. In duration: split wrt 'h' then 'm' to get just number of hours and minutes
4. Create Duration_hour and Duration_min as 2 new columns 
5. Duration hours has to be comverted into minutes: First convert into int from series. Multiply by 60
6. Suration minutes-> convert into int
7. Now add Duration_hours(converted into mins) and Duration minutes-> into a new column Total_Duration. Both have to be in int format 
8. Delete Duration, Duration_hour, Duration_min

In [69]:
final_df['Duration']

0        2h 50m
1        7h 25m
2           19h
3        5h 25m
4        4h 45m
         ...
2666    23h 55m
2667     2h 35m
2668     6h 35m
2669    15h 15m
2670    14h 20m
Name: Duration, Length: 13354, dtype: object

In [70]:
final_df['Duration'].str.split(' ').str[0]

0        2h
1        7h
2       19h
3        5h
4        4h
       ...
2666    23h
2667     2h
2668     6h
2669    15h
2670    14h
Name: Duration, Length: 13354, dtype: object

In [71]:
#splitting wrt 'h'
final_df['Duration'].str.split('h').str[0]

0        2
1        7
2       19
3        5
4        4
        ..
2666    23
2667     2
2668     6
2669    15
2670    14
Name: Duration, Length: 13354, dtype: object

In [74]:
final_df['Duration'].str.split('h').str[1]

0        50m
1        25m
2
3        25m
4        45m
        ...
2666     55m
2667     35m
2668     35m
2669     15m
2670     20m
Name: Duration, Length: 13354, dtype: object

In [67]:
type(final_df['Duration'])

#this is series, we cant split using just once str[0] wrt hours 'h' or space

pandas.core.series.Series

In [113]:
#fetch duration hour
final_df['Duration_hour']= final_df['Duration'].str.split(' ').str[0].str.split('h').str[0]
final_df['Duration_hour']

0        2
1        7
2       19
3        5
4        4
        ..
2666    23
2667     2
2668     6
2669    15
2670    14
Name: Duration_hour, Length: 13351, dtype: object

In [83]:
#convert this series into int (so that we can multiple as well )

#final_df['Duration_hour']= final_df['Duration'].astype(int) -------> doesnt work 
#error: invalid literal for int() with base 10: '2h 50m'
# error: invalid literal for int() with base 10: 5M

In [114]:
#to check where do we have 5m
final_df[final_df['Duration_hour']=='5m']

#mumbai to hyderabad wont have just 5 mins as duration
# better we remove these 2 rows

Empty DataFrame
Columns: [Airline, Source, Destination, Duration, Total_Stops, Additional_Info, Price, Date, Month, Year, Arrival_hour, Arrival_min, Dep_hour, Dep_min, Duration_hour, Duration_min]
Index: []

In [115]:
#to drop these 2 records

final_df.drop(6474, axis=0, inplace=True)
final_df.drop(2660, axis=0, inplace=True)

KeyError: '[6474] not found in axis'

In [116]:
#checking again 
final_df[final_df['Duration_hour']=='5m']

Empty DataFrame
Columns: [Airline, Source, Destination, Duration, Total_Stops, Additional_Info, Price, Date, Month, Year, Arrival_hour, Arrival_min, Dep_hour, Dep_min, Duration_hour, Duration_min]
Index: []

In [120]:
#now converting into int 

final_df['Duration_hour']= final_df['Duration_hour'].astype(int)

In [121]:
final_df['Duration_hour'].dtype

dtype('int64')

In [122]:
#multiplying all hours by 60 to convert into minutes

final_df['Duration_hour']=final_df['Duration_hour']*60
final_df['Duration_hour']

0        120
1        420
2       1140
3        300
4        240
        ...
2666    1380
2667     120
2668     360
2669     900
2670     840
Name: Duration_hour, Length: 13351, dtype: int64

In [123]:
type(final_df['Duration_hour'])

pandas.core.series.Series

In [124]:
final_df['Duration_min']= final_df['Duration'].str.split(' ').str[1].str.split('m').str[0]
final_df['Duration_min']


#str.split(' ').str[1].str.split('m').str[0]
#2h 50m

#first split with space-> get 2nd index-> 50M... again split with m-> get 1st index-> 50

0        50
1        25
2       NaN
3        25
4        45
       ...
2666     55
2667     35
2668     35
2669     15
2670     20
Name: Duration_min, Length: 13351, dtype: object

In [125]:
#I can see that there are null values. There are 1283 null values 
final_df['Duration_min'].isnull().sum()

1283

In [126]:
# fill these null with 0
final_df['Duration_min'].fillna(0, inplace= True)

In [127]:
#check for null again 
final_df['Duration_min'].isnull().sum()

0

In [131]:
final_df['Duration_min'].dtype

dtype('O')

In [132]:
final_df['Duration_min']= final_df['Duration_min'].astype(int)

In [134]:
final_df['Duration_min'].dtype

dtype('int64')

In [135]:
final_df['Total_duration']= final_df['Duration_hour'] + final_df['Duration_min']

In [139]:
final_df['Total_duration'].head()

0     170
1     445
2    1140
3     325
4     285
Name: Total_duration, dtype: int64

In [140]:
final_df.head(2)

,Airline,Source,Destination,Duration,Total_Stops,Additional_Info,Price,Date,Month,Year,Arrival_hour,Arrival_min,Dep_hour,Dep_min,Duration_hour,Duration_min,Total_duration
0,IndiGo,Banglore,New Delhi,2h 50m,0.0,No info,3897.0,24,3,2019,1,10,22,20,120,50,170
1,Air India,Kolkata,Banglore,7h 25m,2.0,No info,7662.0,1,5,2019,13,15,5,50,420,25,445

In [143]:
final_df.drop('Duration', axis=1, inplace=True)
final_df.drop('Duration_min', axis=1, inplace=True)
final_df.drop('Duration_hour', axis=1, inplace=True)


#already executed. hence it is showing error

KeyError: "['Duration'] not found in axis"

In [144]:
final_df.head()

,Airline,Source,Destination,Total_Stops,Additional_Info,Price,Date,Month,Year,Arrival_hour,Arrival_min,Dep_hour,Dep_min,Total_duration
0,IndiGo,Banglore,New Delhi,0.0,No info,3897.0,24,3,2019,1,10,22,20,170
1,Air India,Kolkata,Banglore,2.0,No info,7662.0,1,5,2019,13,15,5,50,445
2,Jet Airways,Delhi,Cochin,2.0,No info,13882.0,9,6,2019,4,25,9,25,1140
3,IndiGo,Kolkata,Banglore,1.0,No info,6218.0,12,5,2019,23,30,18,5,325
4,IndiGo,Banglore,New Delhi,1.0,No info,13302.0,1,3,2019,21,35,16,50,285

## Categorical Features

###  Airlines , Source, Destination and Additional info

In [146]:
final_df["Airline"].unique()

array(['IndiGo', 'Air India', 'Jet Airways', 'SpiceJet',
       'Multiple carriers', 'GoAir', 'Vistara', 'Air Asia',
       'Vistara Premium economy', 'Jet Airways Business',
       'Multiple carriers Premium economy', 'Trujet'], dtype=object)

In [147]:
# Label encoding 

from sklearn.preprocessing import LabelEncoder
labelencoder= LabelEncoder()


#get dummies can also be done
#but as we are working with train and test data, it is better to use transform techniques

In [148]:
final_df['Airline']= labelencoder.fit_transform(final_df['Airline'])

In [151]:
final_df['Airline'].head(5)

0    3
1    1
2    4
3    3
4    3
Name: Airline, dtype: int64

In [152]:
final_df.columns

Index(['Airline', 'Source', 'Destination', 'Total_Stops', 'Additional_Info',
       'Price', 'Date', 'Month', 'Year', 'Arrival_hour', 'Arrival_min',
       'Dep_hour', 'Dep_min', 'Total_duration'],
      dtype='object')

In [161]:
#check uniqu for all these 3 before encoding

In [157]:
final_df['Source']= labelencoder.fit_transform(final_df['Source'])
final_df['Destination']= labelencoder.fit_transform(final_df['Destination'])
final_df['Additional_Info']= labelencoder.fit_transform(final_df['Additional_Info'])

In [154]:
final_df['Destination'].head(2)

0    5
1    0
Name: Destination, dtype: int64

In [160]:
final_df['Source'].head(2)

0    0
1    3
Name: Source, dtype: int64

In [158]:
final_df['Additional_Info'].head(2)

0    8
1    8
Name: Additional_Info, dtype: int64

In [162]:
final_df.shape

(13351, 14)

In [163]:
final_df.head()

,Airline,Source,Destination,Total_Stops,Additional_Info,Price,Date,Month,Year,Arrival_hour,Arrival_min,Dep_hour,Dep_min,Total_duration
0,3,0,5,0.0,8,3897.0,24,3,2019,1,10,22,20,170
1,1,3,0,2.0,8,7662.0,1,5,2019,13,15,5,50,445
2,4,2,1,2.0,8,13882.0,9,6,2019,4,25,9,25,1140
3,3,3,0,1.0,8,6218.0,12,5,2019,23,30,18,5,325
4,3,0,5,1.0,8,13302.0,1,3,2019,21,35,16,50,285

In [164]:
#can also do One hot encoding 

from sklearn.preprocessing import OneHotEncoder
ohe= OneHotEncoder()

In [166]:
#final_df['Airline']= ohe.fit_transform(final_df['Airline'])

#similarly we can do for rest of categorical data

## Segregating data into test and train 


### Segregating trained data into X and y

In [167]:
df_test= final_df[final_df["Price"].isnull()]

In [168]:
df_test.head(2)

,Airline,Source,Destination,Total_Stops,Additional_Info,Price,Date,Month,Year,Arrival_hour,Arrival_min,Dep_hour,Dep_min,Total_duration
0,4,2,1,1.0,8,NaN,6,6,2019,4,25,17,30,655
1,3,3,0,1.0,8,NaN,12,5,2019,10,20,6,20,240

In [169]:
df_train= final_df[~final_df["Price"].isnull()]
df_train.head(2)

,Airline,Source,Destination,Total_Stops,Additional_Info,Price,Date,Month,Year,Arrival_hour,Arrival_min,Dep_hour,Dep_min,Total_duration
0,3,0,5,0.0,8,3897.0,24,3,2019,1,10,22,20,170
1,1,3,0,2.0,8,7662.0,1,5,2019,13,15,5,50,445

In [170]:
X= df_train.drop("Price", axis=1)

In [171]:
X.shape

(10681, 13)

In [172]:
y= df_train['Price']

In [173]:
y.shape

(10681,)

## Dataset is ready to be used in models